Revit 2027 API
ViewShapeBuilder.ViewType Property
 View type where the view-specific shape currently being built will be used
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeTargetViewType ViewType { get; set; }
Public Property ViewType As DirectShapeTargetViewType
	Get
	Set
public:
property DirectShapeTargetViewType ViewType {
	DirectShapeTargetViewType get ();
	void set (DirectShapeTargetViewType value);
}
member ViewType : DirectShapeTargetViewType with get, set
Property Value
DirectShapeTargetViewType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace